Repository: rkshadow999/AgentDesk
Catalog: desktop/src/AgentDesk.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppEdition.Text
source: Local workbench
zh_cn: 本地工作台

# LoadingStatus.Text
source: Starting
zh_cn: 正在启动

# LoadingWorkbench.Text
source: Loading the desktop interface…
zh_cn: 正在加载桌面界面…

# WorkbenchUnavailable.Text
source: Desktop interface unavailable
zh_cn: 桌面界面暂不可用

# EngineNotConnected.Text
source: Engine disconnected
zh_cn: 引擎未连接

# NativeProtected.Text
source: Native compatibility (not sandboxed)
zh_cn: 本机兼容（非沙箱）

# WorkbenchAutomationName
source: AgentDesk workbench
zh_cn: AgentDesk 工作台

# InspectorAutomationName
source: AgentDesk inspector
zh_cn: AgentDesk 检查器

# InspectorSplitter.AutomationProperties.Name
source: Resize inspector
zh_cn: 调整检查器宽度

# InspectorSplitter.AutomationProperties.HelpText
source: Use the Left and Right arrow keys to resize. Press Enter or Space to restore the default width.
zh_cn: 使用左右方向键调整宽度，按 Enter 或空格键恢复默认宽度。

source: Reload
zh_cn: 重新加载

# WorkspaceNotSelected
source: No workspace selected
zh_cn: 未选择工作区

# DesktopStartFailed
source: Could not start the desktop interface: {0}
zh_cn: 无法启动桌面界面：{0}

# DesktopNavigationFailed
source: Desktop interface navigation failed: {0}
zh_cn: 桌面界面加载失败：{0}

source: Interface ready
zh_cn: 界面已就绪

# UnsupportedDesktopMessage
source: The desktop message format is not supported.
zh_cn: 桌面消息格式不受支持。

# DesktopCommandFailed
source: The desktop command failed.
zh_cn: 桌面命令处理失败。

source: Select workspace
zh_cn: 选择工作区

source: Engine connected
zh_cn: 引擎已连接

# EngineStarting
source: Starting engine
zh_cn: 正在启动引擎

source: Task running
zh_cn: 任务正在运行

# WaitingForTask
source: Waiting for a task
zh_cn: 等待任务

source: Engine disconnected
zh_cn: 引擎未连接

source: Engine unavailable
zh_cn: 引擎不可用

source: Engine stopped
zh_cn: 引擎已停止

source: Engine error
zh_cn: 引擎错误

# InterfaceLoading
source: Loading interface
zh_cn: 正在加载界面

source: Action required
zh_cn: 需要处理

source: Interface unavailable
zh_cn: 界面不可用

source: Local workbench
zh_cn: 本地工作台

# EngineClosingSafely
source: Safely shutting down the engine
zh_cn: 正在安全关闭引擎

# EngineClosing
source: Shutting down engine
zh_cn: 正在关闭引擎

# EngineShutdownFailedBody
source: The local engine could not be stopped safely. The window will remain open; close it again to retry.
zh_cn: 未能安全停止本地引擎。窗口仍保持打开，请再次关闭以重试。

source: Shutdown failed; retry
zh_cn: 关闭失败，请重试

source: Engine cleanup failed
zh_cn: 引擎清理失败

# SessionTransferFiles
source: AgentDesk session files
zh_cn: AgentDesk 会话文件

# BackupArchiveFiles
source: AgentDesk backup files
zh_cn: AgentDesk 备份文件

# RestoringBackup
source: Safely restoring local data
zh_cn: 正在安全恢复本地数据

# ApplicationRestartFailed
source: The data operation finished, but AgentDesk could not restart automatically. Reopen the app manually.
zh_cn: 数据已处理，但 AgentDesk 无法自动重启。请手动重新打开应用。

# ProviderCredentialTitle
source: Set model provider credential
zh_cn: 设置模型服务密钥

# ProviderCredentialPrompt
source: API Key (enter it only in this native Windows dialog)
zh_cn: API Key（仅在此 Windows 原生窗口中输入）

# ProviderCredentialInvalid
source: Enter a non-empty API Key without spaces.
zh_cn: 请输入不含空格的非空 API Key。

# CloudAccessTokenTitle
source: Connect self-hosted cloud
zh_cn: 连接自托管云

# CloudAccessTokenPrompt
source: Access token
zh_cn: 访问令牌

# CloudAccessTokenInvalid
source: Enter a non-empty token without spaces.
zh_cn: 请输入不含空格的非空令牌。

# CloudPairingPassphraseTitle
source: Recovery key pairing
zh_cn: 恢复密钥配对

# CloudPairingPassphrasePrompt
source: Pairing passphrase
zh_cn: 配对口令

# CloudPairingPassphraseInvalid
source: Use a passphrase between 16 and 1,024 characters.
zh_cn: 口令长度必须在 16 到 1,024 个字符之间。

# CloudPairingFiles
source: AgentDesk recovery key pairing packages
zh_cn: AgentDesk 恢复密钥配对包

# CloudConfirm
source: Continue
zh_cn: 继续

# CloudCancel
source: Cancel
zh_cn: 取消

# FullAccessApprovalTitle
source: Enable Full Access?
zh_cn: 启用完全访问？

# FullAccessApprovalWarning
source: Full Access automatically approves ACP tool requests, including command execution, with your current Windows user permissions. Tools can read or change files and use the network without another prompt. This is not a sandbox or a workspace boundary. Enable it only if you accept these risks.
zh_cn: 完全访问会以当前 Windows 用户权限自动批准 ACP 工具请求，包括执行命令。工具无需再次提示即可读取或修改文件并使用网络。这不是沙箱，也不限制工具只能访问当前工作区。请仅在你接受这些风险时启用。

# FullAccessApprovalEnable
source: Enable Full Access
zh_cn: 启用完全访问

# FullAccessApprovalCancel
source: Cancel
zh_cn: 取消

# ExtensionApprovalTitle
source: Allow extension operation?
zh_cn: 允许扩展操作？

# ExtensionApprovalBody
source: Type: {0} Action: {1} Target: {2} This operation changes local extension configuration or loads code. Allow it only when you initiated the request and trust the target.
zh_cn: 类型：{0} 操作：{1} 目标：{2} 此操作会修改本地扩展配置或加载代码。仅在你主动发起并信任目标时允许。

# ExtensionApprovalAllowOnce
source: Allow once
zh_cn: 仅允许一次

# ExtensionApprovalDeny
source: Deny
zh_cn: 拒绝

# ExtensionScopeMcp
source: MCP server
zh_cn: MCP 服务器

# ExtensionScopeSkills
source: Skill
zh_cn: 技能

# ExtensionScopeHooks
source: Hook
zh_cn: 钩子

# ExtensionScopePlugins
source: Plugin
zh_cn: 插件

# ExtensionScopeMarketplace
source: Marketplace
zh_cn: 插件市场

# ExtensionActionToggle
source: Toggle enabled state
zh_cn: 切换启用状态

# ExtensionActionConfigureStdio
source: Configure stdio server
zh_cn: 配置 stdio 服务器

# ExtensionActionConfigureHttp
source: Configure HTTP server
zh_cn: 配置 HTTP 服务器

# ExtensionActionDelete
source: Delete
zh_cn: 删除

# ExtensionActionAddPath
source: Add path
zh_cn: 添加路径

# ExtensionActionRemovePath
source: Remove path
zh_cn: 移除路径

# ExtensionActionReset
source: Reset
zh_cn: 重置

# ExtensionActionReload
source: Reload
zh_cn: 重新加载

# ExtensionActionTrust
source: Trust current project
zh_cn: 信任当前项目

# ExtensionActionUntrust
source: Untrust current project
zh_cn: 取消信任当前项目

# ExtensionActionAdd
source: Add
zh_cn: 添加

# ExtensionActionRemove
source: Remove
zh_cn: 移除

# ExtensionActionEnable
source: Enable
zh_cn: 启用

# ExtensionActionDisable
source: Disable
zh_cn: 禁用

# ExtensionActionToggleSource
source: Toggle source state
zh_cn: 切换来源状态

# ExtensionActionInstall
source: Install
zh_cn: 安装

# ExtensionActionUpdate
source: Update
zh_cn: 更新

# ExtensionActionUninstall
source: Uninstall
zh_cn: 卸载

# WindowsAutomationApprovalTitle
source: Allow Windows UI Automation?
zh_cn: 允许 Windows UI 自动化？

# WindowsAutomationApprovalBody
source: Action: {0} Process ID: {1} Target: {2} Value length: {3} characters This native Windows action can control another application. Allow it only when you initiated the request and trust the target.
zh_cn: 操作：{0} 进程 ID：{1} 目标：{2} 值长度：{3} 个字符 此原生 Windows 操作可以控制其他应用。仅在你主动发起并信任目标时允许。

# WindowsAutomationActionFocus
source: Focus window
zh_cn: 聚焦窗口

# WindowsAutomationActionInvoke
source: Invoke control
zh_cn: 调用控件

# WindowsAutomationActionSetValue
source: Set control value
zh_cn: 设置控件值

# WindowsAutomationAllowOnce
source: Allow once
zh_cn: 仅允许一次

# WindowsAutomationDeny
source: Deny
zh_cn: 拒绝
